<h5> Pandas DataFrame is two dimensional size-mutable, potentially heterogeneous tabular data structure with labeled rows and coloums). Pandas DataFrame consists of data, rows and columns. </h5>

In [4]:
import pandas as pd
import numpy as np

lst = ['Kofi', 'Ama', 'Yaw']
df = pd.DataFrame(lst)

print(df)

      0
0  Kofi
1   Ama
2   Yaw

<h3> Pandas DataFrame </h3>

In [2]:
data = {
        'Name': ['Kofi', 'Yaw', 'Ama'],
        'age':[10,20,30],
        'Location': ['Msc', 'MA', 'Accra']
        }

df = pd.DataFrame(data)
print(df)

   Name  age Location
0  Kofi   10      Msc
1   Yaw   20       MA
2   Ama   30    Accra

<h3> Dealing With Rows and Columns </h3>

In [3]:
#selecting two columns
print(df[['Name','Location']])

   Name Location
0  Kofi      Msc
1   Yaw       MA
2   Ama    Accra

In [4]:
print(df.iloc[0])

Name        Kofi
age           10
Location     Msc
Name: 0, dtype: object

In [5]:
df.loc[0]

Name        Kofi
age           10
Location     Msc
Name: 0, dtype: object

In [6]:
data =  pd.read_csv("nba.csv", index_col='Name')
print(data.head(10))

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
Amir Johnson   Boston Celtics    90.0       PF  29.0    6-9   240.0
Jordan Mickey  Boston Celtics    55.0       PF  21.0    6-8   235.0
Kelly Olynyk   Boston Celtics    41.0        C  25.0    7-0   238.0
Terry Rozier   Boston Celtics    12.0       PG  22.0    6-2   190.0
Marcus Smart   Boston Celtics    36.0       PG  22.0    6-4   220.0

                         College      Salary
Name
Avery Bradley              Texas   7730337.0
Jae Crowder            Marquette   6796117.0
John Holland   Boston University         NaN
R.J. Hunter        Georgia State   1148640.0
Jonas Jerebko                NaN   5000000.0
Amir Johnson                 NaN  12000000.0
Jordan Mickey                LSU   1170960.0
Kelly Olynyk             Gonzaga   2165160.0
Terry Rozier          Louisville   1824360.0
Marcus Smart      Oklahoma State   3431040.0

In [7]:
first = data.loc["Terry Rozier"]
Second = data.loc["Amir Johnson"]

print(first, '\n\n\n', Second)

Team        Boston Celtics
Number                12.0
Position                PG
Age                   22.0
Height                 6-2
Weight               190.0
College         Louisville
Salary           1824360.0
Name: Terry Rozier, dtype: object


 Team        Boston Celtics
Number                90.0
Position                PF
Age                   29.0
Height                 6-9
Weight               240.0
College                NaN
Salary          12000000.0
Name: Amir Johnson, dtype: object

In [8]:
first_column = data["Age"]
first_column

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

In [9]:
data.iloc[2]

Team           Boston Celtics
Number                   30.0
Position                   SG
Age                      27.0
Height                    6-5
Weight                  205.0
College     Boston University
Salary                    NaN
Name: John Holland, dtype: object

In [10]:
dic = {
    'First Score':[100, 90,np.nan, 95 ],
    'Second Score':[30, 45, 56, np.nan],
    'Third Score': [np.nan, 40, 80, 98]
}

df = pd.DataFrame(dic)
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [11]:
df.fillna(0, inplace = False)
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [12]:
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [13]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

<h4> Iterating Rows </h4>

In [14]:
dic = {
        'Name': ['Kofi', 'Yaw', 'Ama'],
        'age':[10,20,30],
        'Location': ['Msc', 'MA', 'Accra']
        }
df = pd.DataFrame(dic)

for key, value in df.iterrows():
    print(key,value)

    print()

0 Name        Kofi
age           10
Location     Msc
Name: 0, dtype: object

1 Name        Yaw
age          20
Location     MA
Name: 1, dtype: object

2 Name          Ama
age            30
Location    Accra
Name: 2, dtype: object

In [15]:
df

   Name  age Location
0  Kofi   10      Msc
1   Yaw   20       MA
2   Ama   30    Accra

In [16]:
columns = list(df)

#print(columns)

for i in columns:
    print(df[i][2])

Ama
30
Accra

Inserting a column in a dataFrame

In [17]:
df = pd.DataFrame(
    {'Pokemon': ["Bulb", "Ivy", " Ven", "Charm", "Charm2"], 
    'Type': ["Grass", "Grass","Grass", "Fire", "Fire"]
    }
)

df.head()

  Pokemon   Type
0    Bulb  Grass
1     Ivy  Grass
2     Ven  Grass
3   Charm   Fire
4  Charm2   Fire

In [18]:

df.head()

  Pokemon   Type
0    Bulb  Grass
1     Ivy  Grass
2     Ven  Grass
3   Charm   Fire
4  Charm2   Fire

In [19]:
Type_new = pd.Series([], dtype=int)

for i in range(len(df)):
    if df["Type"][i] == "Grass":
        Type_new[i]= "Green"
    elif df["Type"][i] == "Fire":
        Type_new[i] = "Orange"
    elif df["Type"][i] == "Water":
        Type_new[i] = "Blue"
    else:
        Type_new[i] = df['Type'][i]
    
df.insert(2,"Type New",Type_new)

df.head()

  Pokemon   Type Type New
0    Bulb  Grass    Green
1     Ivy  Grass    Green
2     Ven  Grass    Green
3   Charm   Fire   Orange
4  Charm2   Fire   Orange

<h1>Pandas Series</h1>

<h4> Creating Series </h4>

In [5]:
data = np.array(['Y', 'o', 'u', 'a','r','e'])
ser = pd.Series(data)

ser

0    Y
1    o
2    u
3    a
4    r
5    e
dtype: object

In [11]:
list1 = ['Y', 'o', 'u', 'a','r','e']

seri = pd.Series(list1)
seri[:3]

0    Y
1    o
2    u
dtype: object

In [15]:
df = pd.read_csv('nba.csv')
ser = pd.Series(df['Name'])

data = ser.head(10)
#data.loc[3:6]

data.iloc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
Name: Name, dtype: object

Binary Operations on Series

In [18]:
data = pd.Series([5, 2, 3, 7], index= ['a', 'b', 'c', 'd'])

data1 = pd.Series([1,6,4,9], index = ['a', 'b', 'd', 'e'])

print(data, "\n\n", data1)

a    5
b    2
c    3
d    7
dtype: int64

 a    1
b    6
d    4
e    9
dtype: int64

In [19]:
data.add(data1,fill_value=0)

a     6.0
b     8.0
c     3.0
d    11.0
e     9.0
dtype: float64

In [20]:
data.sub(data1, fill_value=0)

a    4.0
b   -4.0
c    3.0
d    3.0
e   -9.0
dtype: float64

In [22]:
data = pd.read_csv("nba.csv")
data.dropna(inplace=True)

before = data.dtypes

data['Salary'] = data['Salary'].astype(int)
data['Number'] = data['Number'].astype(str)

after = data.dtypes

print("BEFORE CONVERSION\n", before, "\n")
print("AFTER CONVERSION\n", after, "\n")

BEFORE CONVERSION
 Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

AFTER CONVERSION
 Name         object
Team         object
Number       object
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary        int32
dtype: object

In [25]:
# Python program converting
# a series into list

data = pd.read_csv("nba.csv")
data.dropna(inplace= True)

dtype_before = type(data['Salary'])

salary_list = data['Salary'].tolist()

dtype_after = type(data['Salary'])

print("Data type before converting = {}\n Data type after converting = {}".format(dtype_before, dtype_after))
salary_list

Data type before converting = <class 'pandas.core.series.Series'>
 Data type after converting = <class 'pandas.core.series.Series'>

[7730337.0,
 6796117.0,
 1148640.0,
 1170960.0,
 2165160.0,
 1824360.0,
 3431040.0,
 2569260.0,
 6912869.0,
 3425510.0,
 1749840.0,
 2616975.0,
 845059.0,
 1500000.0,
 1335480.0,
 6300000.0,
 134215.0,
 1500000.0,
 19689000.0,
 1140240.0,
 947276.0,
 981348.0,
 947276.0,
 947276.0,
 11235955.0,
 8000000.0,
 1635476.0,
 22875000.0,
 845059.0,
 845059.0,
 1572360.0,
 12650000.0,
 3750000.0,
 1636842.0,
 4000000.0,
 167406.0,
 947276.0,
 1000000.0,
 4626960.0,
 845059.0,
 1074169.0,
 6500000.0,
 2144772.0,
 525093.0,
 3457800.0,
 4582680.0,
 947276.0,
 2869440.0,
 947276.0,
 525093.0,
 13600000.0,
 10050000.0,
 2500000.0,
 7000000.0,
 12000000.0,
 6268675.0,
 650000.0,
 3553917.0,
 245177.0,
 1509360.0,
 3873398.0,
 13800000.0,
 947276.0,
 11370786.0,
 2008748.0,
 14260870.0,
 11710456.0,
 1131960.0,
 845059.0,
 1270964.0,
 3815000.0,
 15501000.0,
 1100602.0,
 111444.0,
 5675000.0,
 525093.0,
 9650000.0,
 18907726.0,
 1100602.0,
 19689000.0,
 947276.0,
 21468695.0,
 3376000.0,
 7085000.0,
 3110796.0,
 1159680.0,
 3000000.0,
 845059.0,
 700000.0,
 845059.0,
 15592217.0,
 1724250.0,
 1155600.0,
 3132240.0,
 5103120.0,
 981348.0,
 947276.0,
 5219169.0,
 13500000.0,
 2127840.0,
 206192.0,
 1160160.0,
 981348.0,
 13500000.0,
 3807120.0,
 1035000.0,
 55722.0,
 947276.0,
 5500000.0,
 2041080.0,
 83397.0,
 981348.0,
 1015421.0,
 1449187.0,
 3398280.0,
 5013559.0,
 15851950.0,
 947276.0,
 525093.0,
 12403101.0,
 7700000.0,
 3156600.0,
 845059.0,
 9500000.0,
 845059.0,
 2250000.0,
 16407500.0,
 4500000.0,
 8500000.0,
 947276.0,
 2380440.0,
 1015421.0,
 13400000.0,
 1391160.0,
 20093064.0,
 1535880.0,
 1147276.0,
 8193029.0,
 16407501.0,
 947276.0,
 947276.0,
 1276000.0,
 19689000.0,
 111196.0,
 8988765.0,
 14260870.0,
 2100000.0,
 2500000.0,
 6500000.0,
 2170465.0,
 111444.0,
 1252440.0,
 2891760.0,
 845059.0,
 3272091.0,
 16000000.0,
 600000.0,
 13913044.0,
 2841960.0,
 6270000.0,
 5000000.0,
 3000000.0,
 4050000.0,
 1007026.0,
 17120106.0,
 8000000.0,
 4000000.0,
 1358880.0,
 211744.0,
 1100000.0,
 7000000.0,
 2357760.0,
 845059.0,
 1007026.0,
 3000000.0,
 2399040.0,
 947276.0,
 1662360.0,
 2943221.0,
 8000000.0,
 14700000.0,
 16407500.0,
 295327.0,
 845059.0,
 5152440.0,
 2109294.0,
 6600000.0,
 1733040.0,
 1449000.0,
 4290000.0,
 1100602.0,
 3950313.0,
 4053446.0,
 2085671.0,
 16407500.0,
 1270964.0,
 15361500.0,
 845059.0,
 947276.0,
 5378974.0,
 8193030.0,
 306527.0,
 6486486.0,
 8229375.0,
 1646400.0,
 200600.0,
 15756438.0,
 1000000.0,
 2489530.0,
 3189794.0,
 947276.0,
 1404600.0,
 5158539.0,
 5000000.0,
 3542500.0,
 4088019.0,
 9588426.0,
 700902.0,
 845059.0,
 1201440.0,
 1230840.0,
 9638555.0,
 9000000.0,
 5464000.0,
 8500000.0,
 1100602.0,
 3036927.0,
 2850000.0,
 7070730.0,
 169883.0,
 1164858.0,
 845059.0,
 10734586.0,
 845059.0,
 1320000.0,
 15514031.0,
 1015421.0,
 10595507.0,
 55722.0,
 3382023.0,
 19689000.0,
 1142880.0,
 947276.0,
 5250000.0,
 10000000.0,
 16407500.0,
 200600.0,
 250750.0,
 3578947.0,
 525093.0,
 1499187.0,
 2000000.0,
 1304520.0,
 2854940.0,
 12000000.0,
 1000000.0,
 5746479.0,
 18671659.0,
 947276.0,
 525093.0,
 3333333.0,
 8000000.0,
 947276.0,
 189455.0,
 947276.0,
 525093.0,
 6110034.0,
 2612520.0,
 6331404.0,
 3034356.0,
 5675000.0,
 2139000.0,
 12000000.0,
 7000000.0,
 4204200.0,
 22192730.0,
 10151612.0,
 2854940.0,
 261894.0,
 845059.0,
 5543725.0,
 525093.0,
 20000000.0,
 981348.0,
 2481720.0,
 947276.0,
 4171680.0,
 845059.0,
 1294440.0,
 2380593.0,
 5192520.0,
 2505720.0,
 4300000.0,
 11250000.0,
 5000000.0,
 4000000.0,
 5694674.0,
 4375000.0,
 561716.0,
 3300000.0,
 273038.0,
 8000000.0,
 1920240.0,
 4662960.0,
 2170465.0,
 1100602.0,
 200600.0,
 15851950.0,
 2814000.0,
 3000000.0,
 3533333.0,
 10449438.0,
 11235955.0,
 1584480.0,
 947276.0,
 4345000.0,
 258489.0,
 1474440.0,
 1282080.0,
 2148360.0,
 2056920.0,
 1938840.0,
 947276.0,
 5703600.0,
 5758680.0,
 2279040.0,
 3750000.0,
 20158622.0,
 3135000.0,
 1140240.0,
 16407500.0,
 1463040.0,
 222888.0,
 3344000.0,
 2021520.0,
 1210800.0,
 4500000.0,
 5138430.0,
 16744218.0,
 525093.0,
 8042895.0,
 625093.0,
 947276.0,
 6980802.0,
 2894059.0,
 6000000.0,
 5016000.0,
 3075880.0,
 4236287.0,
 2525160.0,
 525093.0,
 1415520.0,
 2854940.0,
 2637720.0,
 4775000.0,
 2658240.0,
 9463484.0,
 12000000.0,
 15409570.0,
 1348440.0,
 981348.0,
 2239800.0,
 2433333.0,
 947276.0]

In [27]:
ser = pd.Series([],dtype=int)
ser

Series([], dtype: int32)